ab_test_log_n10000_c200.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking aaa.com (be patient)


Server Software:        nginx
Server Hostname:        aaa.com
Server Port:            80

Document Path:          /kuanglong/bin/test.php
Document Length:        164 bytes

Concurrency Level:      200
Time taken for tests:   6.126 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      3190000 bytes
HTML transferred:       1640000 bytes
Requests per second:    1632.26 [#/sec] (mean)
Time per request:       122.530 [ms] (mean)
Time per request:       0.613 [ms] (mean, across all concurrent requests)
Transfer rate:          508.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       6
Processing:     2   81 399.7     47    5109
Waiting:        2   81 399.7     47    5109
Total:          8   81 400.0     47    5113

Percentage of the requests served within a certain time (ms)
  50%     47
  66%     48
  75%     49
  80%     49
  90%     51
  95%     52
  98%     54
  99%     60
 100%   5113 (longest request)